tutorials/Rotational/freeDecay/09_wing_Duffing_noDamping/system/ensightWrite
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

ensightWrite
{
    type        ensightWrite;
    libs        (utilityFunctionObjects);
    log         true;

    fields      (U p);

    format      ascii;

    overwrite   true;

    writeControl onEnd;

    consecutive false;
}


// ************************************************************************* //
